#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lujop/catinfosalut/runs/run-bwqqKZNJUJ9VhaLT

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
module.app_function.data.aws_iam_policy_document.assume_role: Reading...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
module.app_function.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.lambda_exec will be destroyed
  # (because aws_iam_role.lambda_exec is not in configuration)
  - resource "aws_iam_role" "lambda_exec" {
      - arn                   = "arn:aws:iam::278671691686:role/serverless_lambda" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-06-18T23:43:15Z" -> null
      - force_detach_policies = false -> null
      - id                    = "serverless_lambda" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "serverless_lambda" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUBYRAR6TIERIZUXYY" -> null

      - inline_policy {}
    }

  # module.app_function.aws_apigatewayv2_api.catinfosalut will be created
  + resource "aws_apigatewayv2_api" "catinfosalut" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "CatInfoSalutAPI"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.app_function.aws_apigatewayv2_integration.integration will be created
  + resource "aws_apigatewayv2_integration" "integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.app_function.aws_apigatewayv2_route.default_route will be created
  + resource "aws_apigatewayv2_route" "default_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.app_function.aws_apigatewayv2_stage.default_stage will be created
  + resource "aws_apigatewayv2_stage" "default_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # module.app_function.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.app_function.aws_iam_role_policy_attachment.aws_ssm_read_only_access will be created
  + resource "aws_iam_role_policy_attachment" "aws_ssm_read_only_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "serverless_lambda"
    }

  # module.app_function.aws_iam_role_policy_attachment.aws_xray_write_only_access will be created
  + resource "aws_iam_role_policy_attachment" "aws_xray_write_only_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "serverless_lambda"
    }

  # module.app_function.aws_iam_role_policy_attachment.basic will be created
  + resource "aws_iam_role_policy_attachment" "basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda"
    }

  # module.app_function.aws_lambda_function.catinfosalut will be created
  + resource "aws_lambda_function" "catinfosalut" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "function.zip"
      + function_name                  = "hello_function"
      + handler                        = "io.quarkus.amazon.lambda.runtime.QuarkusStreamHandler::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "v02ZNRJS71sRwbiRpky/nFX9m+KOKDZmvTW2UbMSjiI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DISABLE_SIGNAL_HANDLERS" = "true"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.app_function.aws_lambda_permission.api_gateway_catinfosalut will be created
  + resource "aws_lambda_permission" "api_gateway_catinfosalut" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "hello_function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (sensitive)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.configure_application.data.http.setupWebhook will be read during apply
  # (config refers to values not yet known)
 <= data "http" "setupWebhook" {
      + body             = (known after apply)
      + id               = (known after apply)
      + method           = "POST"
      + request_body     = (known after apply)
      + request_headers  = {
          + "Content-Type"     = "application/x-www-form-urlencoded"
          + "PrivateApiSecret" = (sensitive)
        }
      + response_headers = (known after apply)
      + status_code      = (known after apply)
      + url              = (known after apply)
    }

  # module.configure_application.aws_ssm_parameter.api_url will be created
  + resource "aws_ssm_parameter" "api_url" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "api_url"
      + tags_all  = (known after apply)
      + tier      = (known after apply)
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.configure_application.aws_ssm_parameter.private_api_secret will be created
  + resource "aws_ssm_parameter" "private_api_secret" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "private_api_secret"
      + tags_all  = (known after apply)
      + tier      = (known after apply)
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.configure_application.aws_ssm_parameter.telegram_token will be created
  + resource "aws_ssm_parameter" "telegram_token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "telegram_token"
      + tags_all  = (known after apply)
      + tier      = (known after apply)
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.configure_application.random_password.private_api_secret will be created
  + resource "random_password" "private_api_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 14 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + api_url = (known after apply)

```

</details>

*Pusher: @lujop, Action: `pull_request`, Working Directory: ``, Workflow: `Main workflow on push`*